Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: b)the server is the origin server for the response, the trailer fields consist entirely of optional metadata, and the recipient could use the message (in a manner acceptable to the origin server) without receiving this metadata.
zh_cn: b)服务器是响应的原始服务器，trailer 字段完全由可选元数据组成，并且接收者可以使用该消息(以原始服务器可接受的方式)而不接收该元数据。

source: based on all of the items that preceded them
zh_cn: 基于它们之前的所有项目

source: but I want it to go away once all of its subscribers unsubscribe
zh_cn: 但是，一旦所有订阅者取消订阅，我希望它能够消失

source: by applying an aggregation function to each item in turn and emitting the result
zh_cn: 通过依次对每个项目应用聚合函数并发射结果

source: by attaching a timestamp to them
zh_cn: 通过附加时间戳给他们

source: by attempting to resubscribe to the upstream Observable
zh_cn: 试图重新订阅上游的 Observable

source: by combining the items from two or more Observables sequentially to come up with new items to emit
zh_cn: 通过顺序组合来自两个或多个 Observable 的项目来提出要发射的新项目

source: by delaying my subscription to it for some time after it begins emitting items
zh_cn: 在开始发布项目后的一段时间内延迟我的订阅

source: by emitting all of the items emitted by corresponding Observables
zh_cn: 通过发射相应的 Observables 发射的所有项目

source: by filtering out those that do not match some predicate
zh_cn: 通过过滤掉那些与某些谓词不匹配的东西

source: by means of Pattern and Plan intermediaries
zh_cn: 通过 Pattern 和 Plan 中介

source: by only emitting items that are not followed by other items within some duration
zh_cn: 通过仅在一段时间内发射未跟随其他项目的项目

source: by retrieving it from a Future
zh_cn: 通过从 Future 中获取

source: by sampling the Observable periodically
zh_cn: 通过定期对 Observable 进行抽样

source: by suppressing items that are duplicates of already-emitted items
zh_cn: 通过抑制与已发射项目重复的项目

source: by wrapping them in Notification objects
zh_cn: 将它们包装在 Notification 对象中

source: bytes generated by a secure random number generator.
zh_cn: 字节，由安全随机数生成器生成。

source: c) bits 5 to 1 shall be encoded as 111112.
zh_cn: c) 5 到 1 位应编码为 11111（二进制）。

source: c) bits 5 to 1 shall encode the number of the tag as a binary integer with bit 5 as the most significant bit.
zh_cn: c) 5 到 1 位应将标签的编号编码为二进制整数，其中第 5 位为最高有效位。

source: c) bits 7 to 1 of the first subsequent octet shall not all be zero.
zh_cn: c)第一个后续八位位组的第 7 位到第 1 位不应全为零。

source: c) use the indefinite form (see 8.1.3.6) if the encoding is constructed and is not all immediately available.
zh_cn: c)如果编码是构造的并且并非全部立即可用，则使用不确定形式(见 8.1.3.6)。

source: calculate the sum of numbers emitted by an Observable and emit this sum
zh_cn: 计算 Observable 发射的数字之和并发射此总和

source: calculates the average of numbers emitted by an Observable and emits this average
zh_cn: 计算 Observable 发射的数字的平均值并发射此平均值

source: certificate_list: A sequence (chain) of CertificateEntry structures, each containing a single certificate and set of extensions.
zh_cn: certificate_list：CertificateEntry 结构的序列(链)，每个结构包含一个证书和一组扩展。

source: certificate_request_context: An opaque string which identifies the certificate request and which will be echoed in the client's Certificate message.
zh_cn: certificate_request_context：一个不透明的字符串，用于标识证书请求，并在客户端的 Certificate 消息中进行回显。

source: certificate_request_context: If this message is in response to a CertificateRequest, the value of certificate_request_context in that message.
zh_cn: certificate_request_context：如果此消息是对 CertificateRequest 的响应，则为该消息中的 certificate_request_context 的值。

source: certificate_types has been present in TLS since SSLv3, but was somewhat underspecified.
zh_cn: 自 SSLv3 以来，certificate_types 一直存在于 TLS 中，但有点不明确。

source: cipher_suite: The single cipher suite selected by the server from the list in ClientHello.cipher_suites.
zh_cn: cipher_suite：服务器从 ClientHello.cipher_suites 中的列表中选择的单个密码套件。

source: cipher_suites: A list of the symmetric cipher options supported by the client, specifically the record protection algorithm (including secret key length) and a hash to be used with HKDF, in descending order of client preference.
zh_cn: cipher_suites：客户端支持的对称密码选项列表，特别是记录保护算法(包括密钥长度)和与 HKDF 一起使用的散列，按客户端首选项的降序排列。

source: client: The endpoint initiating the TLS connection.
zh_cn: 客户端（client）：启动 TLS 连接的端点。

source: client_shares: A list of offered KeyShareEntry values in descending order of client preference.
zh_cn: client_shares：按客户端首选项降序提供的 KeyShareEntry 值列表。

source: collects all elements into a `List`
zh_cn: 将所有元素收集到 `List` 中

source: collects all elements into a `List` and sorts it
zh_cn: 将所有元素收集到 `List` 中并对其进行排序

source: collects all elements into a `Map`
zh_cn: 将所有元素收集到 `Map` 中

source: collects all elements into a `Map` with collection
zh_cn: 将所有元素收集到带有集合的 `Map` 中

source: combine items emitted by two Observables whenever an item from one Observable is emitted during a time window defined according to an item emitted by the other Observable
zh_cn: 在根据另一个 Observable 发射的项目定义的时间窗口期间发射一个 Observable 中的项目时，组合两个 Observable 发射的项目

source: combine multiple Observables into one by merging their emissions
zh_cn: 通过合并它们的发射，将多个 Observable 组合成一个

source: combine sets of items emitted by two or more Observables by means of `Pattern` and `Plan` intermediaries
zh_cn: 通过 `Pattern` 和 `Plan` 中介组合两个或多个 Observable 发射的项目集

source: combine the emissions of multiple Observables together via a specified function and emit single items for each combination based on the results of this function
zh_cn: 通过指定的函数将多个 Observable 的发射组合在一起，并根据此函数的结果为每个组合发射单个项目

source: concatenates the items emitted by multiple Singles as Observable emissions
zh_cn: 将多个 Singles 发射的项目连接为 Observable 的发射

source: connection: A transport-layer connection between two endpoints.
zh_cn: 连接（connection）：两个端点之间的传输层连接。

source: containing only the last items emitted
zh_cn: 仅包含最后发射的项目

source: content: The TLSPlaintext.fragment value, containing the byte encoding of a handshake or an alert message, or the raw bytes of the application's data to send.
zh_cn: content：TLSPlaintext.fragment 值，包含握手或警报消息的字节编码，或要发送的应用程序数据的原始字节。

source: convert an Observable into another object or data structure
zh_cn: 将 Observable 转换为另一个对象或数据结构

source: convert an Observable that emits Observables into a single Observable that emits the items emitted by the most-recently-emitted of those Observables
zh_cn: 将发射 Observables 的 Observable 转换为单个 Observable，该 Observable 发射最近发射的 Observables 发射的项目

source: convert an Observable that emits items into one that emits indications of the amount of time elapsed between those emissions
zh_cn: 将发射数据项的 Observable 转换为发射这些发射项之间经过的时间量的指示的 Observable

source: convert an object or a set of objects into an Observable that emits that or those objects
zh_cn: 将对象或一组对象转换为发射该对象或那些对象的 Observable

source: convert an ordinary Observable into a connectable Observable
zh_cn: 将普通的 Observable 转换为可连接的 Observable

source: convert some other object or data structure into an Observable
zh_cn: 将一些其他对象或数据结构转换为 Observable

source: converts a Future into a Single
zh_cn: 将 Future 转化为 Single

source: converts a Single into an Observable that emits the item emitted by the Single and then completes
zh_cn: 将 Single 转换为 Observable，它发射 Single 发射的项，然后完成

source: converts a Single that emits a second Single into a Single that emits the item emitted by the second Single
zh_cn: 将发射第二个 Single 的 Single 转换为发射第二个 Single 发射的项目的 Single

source: converts a Single that makes an error notification into a Single that emits a specified item
zh_cn: 将发射错误通知的 Single 转换为发射指定项目的 Single

source: converts an Observable that emits a single item into a Single that emits that item
zh_cn: 将发射单个项目的 Observable 转换为发射该项目的 Single

source: count the number of items emitted by the source Observable and emit only this value
zh_cn: 计算源 Observable 发射的项目数，并仅发射此值

source: create Observables that have very precise and limited behavior
zh_cn: 创建具有非常精确和有限行为的 Observable

source: create a Single from scratch by calling subscriber methods explicitly
zh_cn: 通过显式调用订阅者方法从头创建 Single

source: create a disposable resource that has the same lifespan as the Observable
zh_cn: 创建一个与 Observable 具有相同生命周期的可释放资源

source: create an Observable from scratch by calling observer methods programmatically
zh_cn: 通过以编程方式调用 observer 方法从头创建一个 Observable

source: create an Observable that emits a particular item or sequence of items repeatedly
zh_cn: 创建一个 Observable，重复发射特定项目或项目序列

source: create an Observable that emits a range of sequential integers
zh_cn: 创建一个发射一系列连续整数的 Observable

source: create an Observable that emits a sequence of integers spaced by a particular time interval
zh_cn: 创建一个 Observable，它以特定时间间隔发射一系列整数

source: create an Observable that emits a single item after a given delay
zh_cn: 创建一个在给定延迟后发射单个项目的 Observable

source: create an Observable that emits the return value of a function
zh_cn: 创建一个发射函数返回值的 Observable

source: creates a new thread for each unit of work
zh_cn: 为每个工作单元创建一个新线程

source: deprecated and dropped
zh_cn: 弃用并删除

source: deprecated overloads dropped
zh_cn: 已删除弃用的重载

source: determine whether all items emitted by an Observable meet some criteria
zh_cn: 确定 Observable 发射的所有项目是否符合某些标准

source: determine whether an Observable emits a particular item or not
zh_cn: 确定 Observable 是否发射特定项目

source: determine whether two Observables emit the same sequence of items
zh_cn: 确定两个 Observable 是否发射相同的项目序列

source: determine, and emit, the maximum-valued item emitted by an Observable
zh_cn: 确定并发射 Observable 发射的最大值项

source: determine, and emit, the minimum-valued item emitted by an Observable
zh_cn: 确定并发射 Observable 发射的最小值项

source: directly from the origin server would open (or reuse) a TCP connection to port 80 of the host "www.example.org" and send the lines:
zh_cn: 将直接从源服务器打开(或重用)TCP 连接到主机“www.example.org”的端口 80 并发送行：

source: disambiguated into `fromArray`, `fromIterable`, `fromFuture`
zh_cn: 通过 `fromArray`，`fromIterable`，`fromFuture` 消除歧义

source: disambiguated to `collectInto` and **RC3** returns `Single<U>`
zh_cn: 修改为 `collectInto` 以消除歧义且 **RC3** 返回 `Single<U>`

source: discard items emitted by an Observable after a second Observable emits an item or terminates
zh_cn: 在第二个 Observable 发射项目或终止后，丢弃 Observable 发射的项目

source: discard items emitted by an Observable after a specified condition becomes false
zh_cn: 在指定条件变为 false 后，丢弃 Observable 发射的项目

source: discard items emitted by an Observable until a second Observable emits an item
zh_cn: 丢弃 Observable 发射的项目，直到第二个 Observable 发射项目为止

source: discard items emitted by an Observable until a specified condition becomes false
zh_cn: 丢弃 Observable 发射的项目，直到指定的条件变为 false

source: divide an Observable into a set of Observables that each emit a different group of items from the original Observable, organized by key
zh_cn: 将一个 Observable 划分为一组 Observable，每个 Observable 从原始 Observable 中发射一组不同的项目，按 key 组织

source: do not create the Observable until the observer subscribes, and create a fresh Observable for each observer
zh_cn: 在观察者订阅之前不要创建 Observable，并为每个观察者创建一个新的 Observable

source: do not emit any items from an Observable but mirror its termination notification
zh_cn: 不从 Observable 中发射任何项目，但镜像其终止通知

source: does it divide its work over multiple threads that may return data to the caller in any order?
zh_cn: 它是否将其工作划分为多个线程，这些线程可能以任何顺序将数据返回给调用者？

source: does it use NIO with an event-loop to do asynchronous network access?
zh_cn: 它是否使用 NIO 和事件循环来进行异步网络访问？

source: does it use an Actor (or multiple Actors) instead of a thread pool?
zh_cn: 它使用 Actor(或多个 Actors)而不是线程池？

source: does it use an event-loop to separate the work thread from the callback thread?
zh_cn: 它是否使用事件循环将工作线程与回调线程分开？

source: does it work asynchronously on a distinct thread?
zh_cn: 它是否在一个不同的线程上异步工作？

source: does it work synchronously on the same thread as the caller?
zh_cn: 它是否与调用者在同一个线程上同步工作？

source: doesn't emit the very last item if the upstream completes within the period, added overloads with `emitLast` parameter
zh_cn: 如果上游在句点内完成，则不会发出最后一项，使用 `emitLast` 参数添加重载

source: doesn't emit the very last item if the upstream completes within the period, use `sample` with the `emitLast` parameter
zh_cn: 如果上游在句点内完成，则不会发出最后一项，请使用带有 `emitLast` 参数的 `sample`

source: dropped
zh_cn: 删除

source: dropped the overload, use `subscribeOn(Scheduler).repeatWhen(Function)` instead
zh_cn: 删除了重载，使用 `subscribeOn(Scheduler).repeatWhen(Function)` 代替

source: dropped the overload, use `subscribeOn(Scheduler).retryWhen(Function)` instead
zh_cn: 删除了重载，使用 `subscribeOn(Scheduler).retryWhen(Function)` 代替

source: dropped, use `count`
zh_cn: 删除，使用 `count`

source: dropped, use `filter(predicate).elementAt(int)`
zh_cn: 删除，使用 `filter(predicate).elementAt(int)`

source: dropped, use `filter(predicate).elementAt(int, T)`
zh_cn: 删除，使用 `filter(predicate).elementAt(int, T)`

source: dropped, use `filter(predicate).first()`
zh_cn: 删除，使用 `filter(predicate).first()`

source: dropped, use `filter(predicate).first(T)`
zh_cn: 删除，使用 `filter(predicate).first(T)`

source: dropped, use `filter(predicate).last()`
zh_cn: 删除，使用 `filter(predicate).last()`

source: dropped, use `filter(predicate).last(T)`
zh_cn: 删除，使用 `filter(predicate).last(T)`

source: dropped, use `filter(predicate).single()`
zh_cn: 删除，使用 `filter(predicate).single()`

source: dropped, use `filter(predicate).single(T)`
zh_cn: 删除，使用 `filter(predicate).single(T)`

source: dropped, use `take`
zh_cn: 删除，使用 ` take`

source: dropped, use manual `just`
zh_cn: 删除，使用 manual `just`

source: else If ClientHello.client_version <= TLS 1.0, and version number check is explicitly disabled:
zh_cn: 否则，如果 ClientHello.client_version <= TLS 1.0，并且显式禁用版本号检查：

source: emit a specified sequence of items before beginning to emit the items from the source Observable
zh_cn: 在开始从源 Observable 中发射项之前，发射指定的项序列

source: emit items from the source Observable, or a default item if the source Observable emits nothing
zh_cn: 从源 Observable 发射项，如果源 Observable 没有发射任何内容，则发射默认项

source: emit only item n emitted by an Observable
zh_cn: 仅发射 Observable 发射的 n 项

source: emit only the first n items emitted by an Observable
zh_cn: 仅发射 Observable 发射的前 n 项

source: emit only the first item, or the first item that meets a condition, from an Observable
zh_cn: 从 Observable 中仅发射第一个项目或满足条件的第一个项目

source: emit only the last n items emitted by an Observable
zh_cn: 仅发射 Observable 发射的最后 n 项

source: emit only the last item emitted by an Observable
zh_cn: 仅发射 Observable 发射的最后一项

source: emit only those items from an Observable that pass a predicate test
zh_cn: 仅发射通过谓词测试的 Observable 中的那些项

source: emit the emissions from two or more Observables without interleaving them
zh_cn: 发射两个或多个 Observable 的发射项而不交错

source: emit the most recent item emitted by an Observable within periodic time intervals
zh_cn: 在周期性时间间隔内发射 Observable 发射的最新项目

source: encrypted_record: The AEAD-encrypted form of the serialized TLSInnerPlaintext structure.
zh_cn: encrypted_record：序列化 TLSInnerPlaintext 结构的 AEAD 加密形式。

source: endpoint: Either the client or server of the connection.
zh_cn: 端点（endpoint）：连接的客户端或服务器。

source: ensure that all observers see the same sequence of emitted items, even if they subscribe after the Observable has begun emitting items
zh_cn: 确保所有观察者都看到相同的发射项序列，即使他们在 Observable 开始发射物品后才订阅

source: even compile because at least 4 `concatWith` overloads exist and the compiler finds the code above ambiguous.
zh_cn: 它甚至不编译因为至少存在 4 个 `concatWith` 重载并且编译器发现上面的代码有歧义。

source: everything after the scheme component delimiter (":") is considered opaque to URI processing.
zh_cn: 方案组件分隔符(“:”)之后的所有内容都被视为对 URI 处理不透明。

source: extensions: A list of extensions.
zh_cn: extensions：扩展列表。

source: extensions: A set of extension values for the CertificateEntry.
zh_cn: extensions：CertificateEntry 的一组扩展值。

source: extensions: A set of extensions describing the parameters of the certificate being requested.
zh_cn: extensions：一组描述所请求证书参数的扩展。

source: extensions: Clients request extended functionality from servers by sending data in the extensions field.
zh_cn: extensions：客户端通过在扩展字段中发送数据来请求服务器的扩展功能。

source: f*.com matches foo.com but not bar.com.
zh_cn: f*.com 匹配 foo.com 但不匹配 bar.com。

source: filters: A list of certificate extension OIDs [RFC5280] with their allowed value(s) and represented in DER-encoded [X690] format.
zh_cn: filters：证书扩展 OID [RFC5280] 的列表及其允许值，并以 DER 编码 [X690] 格式表示。

source: followed by the remainder of the Request.
zh_cn: 然后是请求的其余部分。

source: followed by the remainder of the request message.
zh_cn: 然后是请求消息的其余部分。

source: for each observer that subscribes
zh_cn: 对于每个订阅的观察者

source: force an Observable to make serialized calls and to be well-behaved
zh_cn: 强制 Observable 进行序列化调用并保持良好状态

source: fragment: The data being transmitted.
zh_cn: fragment：正在传输的数据。

source: from a timeout by switching to a backup Observable
zh_cn: 从超时切换到备份 Observable

source: from an upstream error notification
zh_cn: 来自上游错误通知

source: from scratch, with custom logic
zh_cn: 从头开始，使用自定义逻辑

source: from the perspective of `flatMapSingle`, `sourceObservable` is a multi-valued source and thus the mapping may result in multiple values as well).
zh_cn: 从 `flatMapSingle` 的角度来看，`sourceObservable` 是一个多值源，因此映射也可能导致多个值。

source: given two or more source Observables, emit all of the items from only the first of these Observables to emit an item
zh_cn: 给定两个或多个源 Observable，仅从第一个发射一个项目 Observable 中发射所有项目

source: group: The named group for the key being exchanged.
zh_cn: group：要交换的密钥的命名组。

source: handshake: An initial negotiation between client and server that establishes the parameters of their subsequent interactions within TLS.
zh_cn: 握手（handshake）：客户端和服务器之间的初始协商，用于在 TLS 中建立其后续交互的参数。

source: has an effective request URI of
zh_cn: 有一个有效的请求 URI

source: higher-level or application protocols may define additional requirements.
zh_cn: 更高级别或应用程序协议可以定义其他要求。

source: however, the continuation in this case stays `Observable` instead of the likely more appropriate `Single`.
zh_cn: 然而，在这种情况下的延续仍然是 `Observable` 而不是可能更合适的 `Single`。

source: http and https URI Normalization and Comparison
zh_cn: http 和 https URI 规范化和比较

source: http and https URI Normalization and Comparison ....19
zh_cn: http 和 https URI 规范化和比较 ....19

source: if a source Observable sends an `onError` notification, resubscribe to it in the hopes that it will complete without error
zh_cn: 如果一个源 Observable 发送一个 `onError` 通知，重新订阅它，希望它能完成而不会出错

source: if a specified period of time elapses without it emitting an item
zh_cn: 如果指定的时间段过去而没有发射项目

source: if they immediately follow the item they are duplicates of
zh_cn: 如果他们立即跟随该项目他们是重复的

source: in either the request or the response header fields indicates that the sender is going to close the connection after the current request/response is complete (Section 6.6).
zh_cn: 在请求或响应首部字段中指示发送方将在当前请求/响应完成后关闭连接(第 6.6 节)。

source: indicates that the payload body has been compressed using the gzip coding and then chunked using the chunked coding while forming the message body.
zh_cn: 表示有效载荷主体已经使用 gzip 编码压缩，然后在形成消息体时使用分块编码进行分块。

source: inlined as `blockingY()` operators, except `toFuture`
zh_cn: 内联为 `blockingY()` 操作符，除了 `toFuture`

source: instruct a connectable Observable to begin emitting items to its subscribers
zh_cn: 指示可连接的 Observable 开始向其订阅者发送项目

source: instructs the Single to call the subscriber methods on a particular Scheduler
zh_cn: 指示 Single 在特定的 Scheduler 上调用订阅者方法

source: instructs the Single to operate on a particular Scheduler
zh_cn: 指示 Single 在特定的 Scheduler 上操作

source: into an indicator of the amount of time that lapsed before the emission of the item
zh_cn: 成为项目发射前经过的时间的指标

source: it allows uniform semantic interpretation of common syntactic conventions across different types of resource identifiers; it allows introduction of new types of resource identifiers without interfering with the way that existing identifiers are used; and, it allows the identifiers to be reused in many different contexts, thus permitting new applications or protocols to leverage a pre-existing, large, and widely-used set of resource identifiers.
zh_cn: 它允许跨不同类型的资源标识符对通用语法约定进行统一的语义解释；它允许引入新类型的资源标识符，而不会干扰现有标识符的使用方式；并且，它允许标识符在许多不同的上下文中重用，从而允许新的应用程序或协议利用预先存在的，大量且广泛使用的资源标识符集。

source: it takes 4.5 hours to use up 2**32 octets of sequence space.
zh_cn: 用光 2 ** 32 个八位字节的序列空间需要 4.5 小时。

source: key_exchange: Key exchange information.
zh_cn: key_exchange：密钥交换信息。

source: legacy_compression_method: A single byte which MUST have the value 0.
zh_cn: legacy_compression_method：必须具有值 0 的单个字节。

source: legacy_compression_methods: Versions of TLS before 1.3 supported compression with the list of supported compression methods being sent in this field.
zh_cn: legacy_compression_methods：TLS 1.3 之前支持压缩的版本，在此字段中发送支持的压缩方法列表。

source: legacy_record_version: MUST be set to 0x0303 for all records generated by a TLS 1.3 implementation other than an initial ClientHello (i.e., one not generated after a HelloRetryRequest), where it MAY also be 0x0301 for compatibility purposes.
zh_cn: legacy_record_version：对于除初始 ClientHello 之外的 TLS 1.3 实现生成的所有记录(即，在 HelloRetryRequest 之后未生成的记录)，必须设置为 0x0303，其中出于兼容性目的，它也可以是 0x0301。

source: legacy_record_version: The legacy_record_version field is always 0x0303.
zh_cn: legacy_record_version：legacy_record_version 字段始终为 0x0303。

source: legacy_session_id: Versions of TLS before TLS 1.3 supported a "session resumption" feature which has been merged with pre-shared keys in this version (see Section 2.2).
zh_cn: legacy_session_id：TLS 1.3 之前的 TLS 版本支持“会话恢复”功能，该功能已与此版本中的预共享密钥合并(请参阅第 2.2 节)。

source: legacy_session_id_echo: The contents of the client's legacy_session_id field.
zh_cn: legacy_session_id_echo：客户端 legacy_session_id 字段的内容。

source: legacy_version: In previous versions of TLS, this field was used for version negotiation and represented the highest version number supported by the client.
zh_cn: legacy_version：在以前版本的 TLS 中，此字段用于版本协商，并表示客户端支持的最高版本号。

source: legacy_version: In previous versions of TLS, this field was used for version negotiation and represented the selected version number for the connection.
zh_cn: legacy_version：在以前版本的 TLS 中，此字段用于版本协商，并表示连接的选定版本号。

source: length: The length (in bytes) of the following TLSCiphertext.encrypted_record, which is the sum of the lengths of the content and the padding, plus one for the inner content type, plus any expansion added by the AEAD algorithm.
zh_cn: length：后续 TLSCiphertext.encrypted_record 的长度(以字节为单位)，它是内容和填充的长度之和，加上内部内容类型的长度加上 AEAD 算法添加的任何扩展。

source: length: The length (in bytes) of the following TLSPlaintext.fragment.
zh_cn: length：以下 TLSPlaintext.fragment 的长度(以字节为单位)。

source: make a Connectable Observable behave like an ordinary Observable
zh_cn: 使 Connectable Observable 的行为类似于普通的 Observable

source: meant for I/O-bound work such as asynchronous performance of blocking I/O, this scheduler is backed by a thread-pool that will grow as needed; for ordinary computational work, switch to Schedulers.computation( ); Schedulers.io( ) by default is a CachedThreadScheduler, which is something like a new thread scheduler with thread caching
zh_cn: 对于 I/O 密集型工作，例如阻塞 I/O 的异步性能，此调度器由一个将根据需要增长的线程池支持；对于普通的计算工作，请切换到 Schedulers.computation( ); Schedulers.io( ) 默认情况下是 CachedThreadScheduler，类似于带有线程缓存的新线程调度器

source: meant for computational work such as event-loops and callback processing; do not use this scheduler for I/O (use Schedulers.io( ) instead); the number of threads, by default, is equal to the number of processors
zh_cn: 用于计算工作，如事件循环和回调处理；不要将此调度器用于 I/O(请改用 Schedulers.io( ));默认情况下，线程数等于处理器数

source: merges the items emitted by multiple Singles as Observable emissions
zh_cn: 将多个 Singles 发射的数据项合并为 Observable 的发射

source: mirror the source Observable, but issue an error notification if a particular period of time elapses without any emitted items
zh_cn: 镜像源 Observable，但是如果在没有任何发射项目的情况下经过了特定的时间段，则发射错误通知

source: move the emission of an item from a Single forward in time
zh_cn: 延时 Single 发射项目的时间

source: multiple items
zh_cn: 多个项目

source: no fields are altered.
zh_cn: 没有字段被更改。

source: not present
zh_cn: 不存在

source: o Appending data to a resource's existing representation(s).
zh_cn: o 将数据附加到资源的现有表示中。
